#ให้เขียนโปรเเกรม รับฃื่อ อายุทางเเป้นพิมพ์ เเล้วเเสดงผลออกมาว่า ชื่อ อายุนั้นเป็น เด็ก คนหนุ่ม หรือคนเเก่
#อายุน้อยกว่า 18 คือเด็ก /อายุ 19-45 คนหนุ่ม/46 ขึ้นไปคือคนเเก่

#หาฟีเจอร์การทำงาน เพื่อจะเอาไปเขียนเป็นฟังก์ชัน
#ฟีเจอร์ รับค่าข้อมูล , ตรวจสอบเเละเเสดงผลว่าเป็น เด็ก คนหนุ่ม หรือคนเเก่ , เเสดงชื่อโปรเเกรม

def SPN():
    print("**--โปรเเกรมตรวจสอบความเป็นเด็ก หนุ่ม แก่--**")

def inputD():
    name = input("ใส่ชื่อ :")
    age = int(input("ใส่อายุ :"))
    return name, age

def CSS(name,age):
    if age <= 18 :
        print(f"คุณ {name} อายุ {age} ปี เป็นเด็กเหี้ย")
    elif age >= 19 and age <=45 :
        print(f"คุณ {name} อายุ {age} ปี เป็นสุดหล่อ")
    else :
        print(f"คุณ {name} อายุ {age} ปี เป็นอีเเก่")

print("-------------------------------------------")
SPN()
print("-------------------------------------------")
name ,age = inputD()
print("-------------------------------------------")
CSS(name,age)
print("-------------------------------------------")
